/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Subtitle" = "Ligou-se com sucesso a %@.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Title" = "Ligação bem sucedida";

/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Subtitle" = "A sua ligação a %@ foi atualizada com sucesso.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Title" = "Atualização bem sucedida";

/* Description shown in the concent information screen. */
"ConsentInformation.Description" = "Ao continuar através deste serviço, iremos recolher os seus dados financeiros. Estes são os seus dados que iremos recolher:";

/* Title shown in the concent information screen. */
"ConsentInformation.Title" = "Iremos recolher os seguintes dados seus";

/* Description text for add credentials screen. */
"Credentials.Description" = "Inicie sessão em %@ para continuar";


/* Text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.ConsentText" = "%@ vai receber alguma da sua informação financeira. Leia mais";
/* Title for action to continue adding credentials. */
"Credentials.Discard.ContinueAction" = "Continua a edição";

/* Title for action to discard adding credentials. */
"Credentials.Discard.PrimaryAction" = "Ignorar alterações";

/* Title for action sheet presented when user tries to dismiss modal while adding credentials. */
"Credentials.Discard.Title" = "Tem a certeza de que pretende ignorar esta nova credencial?";

/* Title for error shown when authentication failed while adding credentials. */
"Credentials.Error.AuthenticationFailed" = "Falha ao autenticar";

/* Message for error shown when credentials already exists. */
"Credentials.Error.CredentialsAlreadyExists" = "Já tem uma ligação a este banco ou serviço.";

/* Title for error shown when a permanent failure occured while adding credentials. */
"Credentials.Error.PermanentFailure" = "Erro permanente";

/* Title for error shown when a temporary failure occured while adding credentials. */
"Credentials.Error.TemporaryFailure" = "Erro temporário";

/* Text for BankID button shown in the add credentials/authenticate screen. */
"Credentials.OpenBankID" = "Abrir BankID";

/* Privacy policy clickable text used in Credentials.TermsAndConsentText. */
"Credentials.PrivacyPolicy" = "Política de Privacidade";


/* Read more text (clickable) to lead to consent information. */
"Credentials.ReadMore" = "Leia mais";
/* Terms and conditions clickable text used in Credentials.TermsAndConsentText. */
"Credentials.TermsAndConditions" = "Termos e Condições";

/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions, Privacy Policy. And the text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.TermsAndConsentText" = "Ao utilizar o serviço, concorda com os %@ e %@ da Tink. A %@ vai obter partes da sua informação financeira. %@";


/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions and Privacy Policy. */
"Credentials.TermsText" = "Ao usar o serviço, concorda com os Termos e condições e Política de privacidade";
/* Title for add credentials/authenticate screen. */
"Credentials.Title" = "Autenticação";


/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Subtitle" = "A sua conta foi ligada com sucesso a %@.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Title" = "Ligação com sucesso";
/* Text for the warning shown when the developer is unverified. */
"Credentials.UnverifiedClient" = "Por verificar - esta solução apenas está construída para fins de desenvolvimento. Não introduza as credenciais do seu banco se não confiar no desenvolvedor.";

/* View details text (clickable) to lead to consent information that used in Credentials.TermsAndConsentText. */
"Credentials.ViewDetails" = "Ver detalhes";

/* Text shown for progress indicator dialog when in loading state. */
"CredentialsStatus.Authorizing" = "A autorizar...";

/* Text shown for dialog when supplemental information is cancelled and waiting for credential status update. */
"CredentialsStatus.Cancelling" = "A cancelar...";

/* Text shown for dialog when supplemental information is submitted and waiting for credential status update. */
"CredentialsStatus.Sending" = "A enviar...";

/* Text shown for progress indicator dialog when status is CredentialStatus.Updating. */
"CredentialsStatus.Updating" = "A ligar a %@, por favor aguarde...";

/* Fallback text shown when fail to get bank name while updating credentials. */
"CredentialsStatus.UpdatingFallback" = "A ligar, por favor aguarde...";

/* Text shown when adding credentials and waiting for authentication on another device. */
"CredentialsStatus.WaitingForAuthenticationOnAnotherDevice" = "À espera da autenticação noutro disposiivo";

/* Text for field validation error shown when text entered exceeds character limit. */
"Field.Validation.MaxLengthLimit" = "Este campo não pode ter mais de %d caracteres";

/* Text for field validation error shown when text entered is shorter than required. */
"Field.Validation.MinLengthLimit" = "Este campo deve ter, pelo menos, %d caracteres.";

/* Text for field validation error shown when no text is entered for a required field. */
"Field.Validation.RequiredFieldEmptyValue" = "Este campo não pode estar vazio.";

/* Text used to form a list. */
"Generic.And" = "E";

/* Text shown for Cancel button. */
"Generic.Cancel" = "Cancelar";

/* Title for cancelled request. */
"Generic.Cancelled" = "Cancelado";

/* Title for generic button to continue an action. */
"Generic.Continue" = "Continuar";

/* Title for action to dismiss error alert. */
"Generic.Dismiss" = "Ignorar";

/* Title for action to confirm an event. */
"Generic.Done" = "Concluído";

/* Title generic alert. */
"Generic.Error" = "Aconteceu algo de errado. Por favor, tente novamente mais tarde.";

/* Title for generic text to login. */
"Generic.Login" = "Iniciar sessão";

/* Title for action to confirm alert. */
"Generic.OK" = "OK";

/* Title for action to retry a failed request. */
"Generic.Retry" = "Voltar a tentar";

/* Title for error alert if error doesn't contain a description. */
"Generic.ServiceAlert.FallbackTitle" = "De momento, o serviço está indisponível.";

/* Description of the provider capability Checking Accounts. */
"ProviderCapability.CheckingAccounts" = "A verificar contas";

/* Description of the provider capability Credit Cards. */
"ProviderCapability.CreditCards" = "Cartões de crédito";

/* Description of the provider capability E-Invoices. */
"ProviderCapability.EInvoices" = "Faturas eletrónicas";

/* Description of the provider capability Identity Data. */
"ProviderCapability.IdentityData" = "Dados de identificação";

/* Description of the provider capability Investments. */
"ProviderCapability.Investments" = "Investimentos";

/* Description of the provider capability Loans. */
"ProviderCapability.Loans" = "Empréstimos";

/* Description of the provider capability Mortgage Aggregation. */
"ProviderCapability.MortgageAggregation" = "Agregação da hipoteca";

/* Description of the provider capability Mortgage Loan. */
"ProviderCapability.MortgageLoan" = "Empréstimo de hipoteca";

/* Description of the provider capability Payments. */
"ProviderCapability.Payments" = "Pagamentos";

/* Description of the provider capability Savings Accounts. */
"ProviderCapability.SavingsAccounts" = "Contas de poupança";

/* Description of the provider capability Transfers. */
"ProviderCapability.Transfers" = "Transferências";

/* Description for error when providers could not be loaded. */
"ProviderList.Error.Description" = "Estamos informados quanto a este erro e estamos a trabalhar arduamente para o resolver. Aguardar um pouco e tente novamente mais tarde.";

/* Description for error when providers could not be loaded and it is likely it's a temporary error. */
"ProviderList.Error.Temporary" = "Este erro pode ser temporário. Por favor, tente novamente e verifique se o problema se mantém.";

/* Title for when providers could not be loaded. */
"ProviderList.Error.Title" = "Lamentamos, mas não conseguimos, de momento, carregar nenhum banco";

/* Placeholder in search field shown in provider list. */
"ProviderList.SearchHint" = "Procurar por banco ou cartão";

/* Title for list of all providers. */
"ProviderList.Title" = "Escolha o banco";

/* Information text shown in the choose access type screen. */
"SelectAccessType.Information" = "Por motivos relacionados com as normas da UE, diferentes tipos de conta têm de ser ligados em separado.";

/* Title for the other account type (not an open banking account type) on the choose access type screen. */
"SelectAccessType.OtherType" = "Outro";

/* Title of the choose access type screen. */
"SelectAccessType.Title" = "Tipo de ligação";

/* Title for the business authentication user type */
"SelectAuthenticationUserType.Business" = "Negócio";

/* Title for the corporate authentication user type */
"SelectAuthenticationUserType.Corporate" = "Empresarial";

/* Title for the personal authentication user type */
"SelectAuthenticationUserType.Personal" = "Pessoal";

/* Title when picking authentication user type. */
"SelectAuthenticationUserType.Title" = "Tipo de início de sessão";

/* Title for choose credential type screen. */
"SelectCredentialsType.Title" = "Método de início de sessão";

/* Description shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeDescription" = "Abra a aplicação móvel Bank ID e digitalize este código QR para autenticar.";

/* Error shown when QR code cannot be fetched/generated/displayed. */
"SupplementalInformation.QRCodeError" = "Ocorreu um erro ao carregar o código QR. Por favor, tente novamente mais tarde.";

/* Title shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeTitle" = "Abra a aplicação BankID";

/* Title for button to submit supplemental information. */
"SupplementalInformation.Submit" = "Submeter";

/* Title of the supplemental information dialog. */
"SupplementalInformation.Title" = "Informação adicional";

/* Title for action to download app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Download" = "Transferir";

